app/views/transfers/_form.html.erb

    <% if transfer.new_record? && user_signed_in? %>
      <%= form.collection_select :receiver_id,
          User.where.not(id: current_user.id).order(:nickname),
          :id,
          lambda { |u| "#{u.nickname} (Баланс: #{number_to_currency(u.balance, unit: '₴', separator: ',', delimiter: ' ')})" },
          { prompt: "Оберіть отримувача" },
          { class: 'form-control', style: 'padding: 12px; border: 2px solid #e0e0e0; border-radius: 8px; font-size: 16px;', required: true } %>
    <% elsif !transfer.new_record? %>
      <%= form.collection_select :receiver_id,
          User.all.order(:nickname),
          :id,
          lambda { |u| "#{u.nickname} (Баланс: #{number_to_currency(u.balance, unit: '₴', separator: ',', delimiter: ' ')})" },
          {},
          { class: 'form-control', style: 'padding: 12px; border: 2px solid #e0e0e0; border-radius: 8px; font-size: 16px;', required: true } %>
---
SELECT "users".* FROM "users" ORDER BY "users"."nickname" ASC